# St7SetHRALoadType

Assigns the load type for harmonic response analysis.

long St7SetHRALoadType(long uID, long LType)

Input Parameters

uID

Strand7 model file ID.

LType

One of hlBaseAcc, hlBaseVel, hlBaseDisp or hlAppliedLoad.